FemDesign.Loads.LineLoad
line_load_type

FemDesign.Loads.LineLoad.#ctor
Parameterless constructor for serialization.

FemDesign.Loads.LineLoad.#ctor(FemDesign.Geometry.Edge,FemDesign.Geometry.Vector3d,FemDesign.Geometry.Vector3d,FemDesign.Loads.LoadCase,FemDesign.Loads.ForceLoadType,System.String,System.Boolean,System.Boolean)
Internal constructor.

FemDesign.Loads.LineLoad.VariableForce(FemDesign.Geometry.Edge,FemDesign.Geometry.Vector3d,FemDesign.Geometry.Vector3d,FemDesign.Loads.LoadCase,System.String,System.Boolean,System.Boolean)
Create a Distributed Force Load to be applied to an Edge [kNm/m]
edge:
startForce:
endForce:
loadCase:
comment:
constLoadDir:
loadProjection:
Returns:

FemDesign.Loads.LineLoad.VariableMoment(FemDesign.Geometry.Edge,FemDesign.Geometry.Vector3d,FemDesign.Geometry.Vector3d,FemDesign.Loads.LoadCase,System.String,System.Boolean,System.Boolean)
Create a Distributed Moment Load to be applied to an Edge [kN/m]
edge:
startForce:
endForce:
loadCase:
comment:
constLoadDir:
loadProjection:
Returns:

FemDesign.Loads.LineLoad.UniformForce(FemDesign.Geometry.Edge,FemDesign.Geometry.Vector3d,FemDesign.Loads.LoadCase,System.String,System.Boolean,System.Boolean)
Create a UniformDistributed Force Load to be applied to an Edge [kNm/m]
edge:
constantForce:
loadCase:
comment:
constLoadDir:
loadProjection:
Returns:

FemDesign.Loads.LineLoad.UniformMoment(FemDesign.Geometry.Edge,FemDesign.Geometry.Vector3d,FemDesign.Loads.LoadCase,System.String,System.Boolean,System.Boolean)
Create a Uniform Distributed Moment Load to be applied to an Edge [kNm/m]
edge:
constantForce:
loadCase:
comment:
constLoadDir:
loadProjection:
Returns: